snlkuharlocal/src/DataProcessors/ПроверкаКоррректностиЛенты/ПроверкаКоррректностиЛенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаКоррректностиЛенты</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Documents/ЗаданиеНаМаркировку/ЗаданиеНаМаркировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаМаркировку</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фУпрощенныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьПалеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВБлочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукНаПалете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Штука</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Блочок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Коробка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодПалеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистМаркировки</name>
      <type>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаБронированияКМ</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистМаркировки</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПроверкаКоррректностиЛенты/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗаданиеНаМаркировку") Тогда
		
		ЗаданиеНаМаркировку = Параметры.ЗаданиеНаМаркировку; 		
				
	КонецЕсли;
	
	ДобавитьУсловноеОформление(); 
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ТолькоПросмотр Тогда Возврат КонецЕсли;	
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	Данные=СтрЗаменить(Данные,Символы.ПС,"");
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	ОтработкаДанныхШККм(Данные);

КонецПроцедуры

&НаКлиенте
Процедура ОтработкаДанныхШККм(Данные)
	
	//Перем ДанныеМаркиЧЗ, КоличествоИзШК, НоваяСтрока, Номенклатура, Отбор, СтрокиСкан, ТипАгрегацииЧКод, ШтрихкодУпаковки;
	
	ДанныеМаркиЧЗ=Неопределено;
	
	КоличествоИзШК	= 0;
	Номенклатура	= НайтиТоварПоШтрихКоду(Данные,неопределено,КоличествоИзШК,ДанныеМаркиЧЗ);
	
	Если ДанныеМаркиЧЗ.СканировалиКодЧЗ  тогда
		
		ШтрихкодУпаковки = ДанныеМаркиЧЗ.МаркаЧЗ; 		
		
		Если ЗначениеЗаполнено(КодАгрегации) Тогда
			
			//заполняем ТЧ
			Отбор = Новый Структура("КодМаркировки",ШтрихкодУпаковки);
			
			СтрокиСкан =  ДанныеОтсканированные.НайтиСтроки(Отбор); 
			Если СтрокиСкан.Количество() = 0  Тогда
				
				ТипАгрегацииЧКод = ОпределитьТипАгрегации(ШтрихкодУпаковки);
				Если ТипАгрегацииЧКод = неопределено Тогда
					
					Сообщить("неверно отсканированный код",СтатусСообщения.Важное); 
					
					Возврат; 	
					
				КонецЕсли;
				
				НоваяСтрока = ДанныеОтсканированные.Добавить();
				НоваяСтрока.КодМаркировки =  ШтрихкодУпаковки; 
				НоваяСтрока.ТипАгрегации = ТипАгрегацииЧКод;  
				
			КонецЕсли;
			
		Иначе 
			ТипАгрегацииЧКод = ОпределитьТипАгрегации(ШтрихкодУпаковки,истина);
			
			Если ТипАгрегацииЧКод = неопределено Тогда
				
				Сообщить("неверно отсканированный код",СтатусСообщения.Важное); 
				Возврат; 	
				
			КонецЕсли;
			КодАгрегации = ШтрихкодУпаковки;
			ТипАгрегации = ТипАгрегацииЧКод; 
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция ОпределитьТипАгрегации(ШтрихкодУпаковки,ВШапку  = Ложь)
                                                 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ЭтоШтука,
		|	ЛОЖЬ КАК ЭтоБлочок,
		|	ЛОЖЬ КАК ЭтоКоробка,
		|	ЛОЖЬ КАК ЭтоПаллета,
		|	4 КАК ЧисловойКод
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	3
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодБлочка = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	2
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодКоробки = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	1
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодПалеты = &ШтрихкодУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаМаркировку);
	Запрос.УстановитьПараметр("ШтрихкодУпаковки", ШтрихкодУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВШапку И ВыборкаДетальныеЗаписи.ЭтоШтука Тогда
			
			Сообщить("Для проверки отсканируйте паллету, короб или блочок!!!",СтатусСообщения.Важное); 
			
			Возврат неопределено; 
		Иначе 
			
			Возврат ВыборкаДетальныеЗаписи.ЧисловойКод; 
			
		КонецЕсли;
		
	Иначе 
		
		Возврат неопределено; 
	КонецЕсли;

КонецФункции // ЗаполнитьДанныеНаФорме()


&НаКлиенте
Процедура ДобавитьКодВручную(Команда)
	
	перем КодКМ; 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКМВручную",ЭтаФорма);
	
	ОписаниеТипов = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200)); 
	ПоказатьВводЗначения(ОписаниеОповещения,КодКМ,"Введите КМ",ОписаниеТипов); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПослеВводаКМВручную(ШККм,ДополнительныеПараметры) Экспорт 
	Если ШККм = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если СтрДлина(ШККм) = 18 Тогда
		
		ШККм = "00" + ШККм; 	
	Иначе 
		ШККм1  =  СокрЛП(Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(ШККм));
		
		ШККм = Лев(ШККм1, 31) + СтрЗаменить(Сред(ШККм1, 32), Символ(29), "<GS>"); 
		
		КоличествоНулей = 83 - СтрДлина(ШККм); 
		Дополнить = Формат(1,"ЧЦ="+КоличествоНулей+"; ЧВН="); 
		
		ШККм  = ШККм  + Дополнить; 
	КонецЕсли;

	ОтработкаДанныхШККм(ШККм); 

КонецПроцедуры // ОписаниеТипов()

&НаКлиенте
Процедура ПроверитьВведенныеДанные(Команда)
	Если Не ЗначениеЗаполнено(КодАгрегации)
		 ИЛИ Не ЗначениеЗаполнено(ТипАгрегации) Тогда
		
		Сообщить("Для проверки отсканируйте паллету, короб или блочок!!!",СтатусСообщения.Важное);
		
		Возврат; 
		
	КонецЕсли;
	
	Если ДанныеОтсканированные.Количество() = 0 Тогда
	
		Сообщить("Для проверки заполните таблицу!!!",СтатусСообщения.Важное);
		
		Возврат; 
		
	КонецЕсли;
	
	МассивВозможныхКодов = ПолучитьМассивКодовПоТипуАгрегации(ТипАгрегации,ЗаданиеНаМаркировку,КодАгрегации);
	
	Для каждого СтрокаДанных Из ДанныеОтсканированные Цикл
	
		Если МассивВозможныхКодов.Найти(СтрокаДанных.КодМаркировки) = Неопределено  Тогда
		
			СтрокаДанных.Ошибка = Истина;  
		Иначе 
			СтрокаДанных.Проверено = Истина;
		КонецЕсли;
		 
	
	КонецЦикла;
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Функция ПолучитьМассивКодовПоТипуАгрегации(ТипАгрегации,ДокОснование,КодКМ)
	Запрос = Новый Запрос;
	
	ТекстЗапросаШтуки = 
	"ВЫБРАТЬ Различные
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодУпаковки КАК Штрихкод
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.%ИмяКолонки% = &КодКМ
	|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = &Ссылка "; 
	
	ТекстЗапросаБлочки =
	"ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодБлочка
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.%ИмяКолонки% = &КодКМ
	|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = &Ссылка";
	
	ТекстЗапросаКоробки =
	"ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодКоробки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.%ИмяКолонки% = &КодКМ
	|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = &Ссылка";
	
	Если ТипАгрегации = 3 Тогда   //блочок
		
		Запрос.Текст = ТекстЗапросаШтуки;
		ИмяКолонки = "ШтрихкодБлочка"; 
		
	ИначеЕсли ТипАгрегации = 2 Тогда //коробка
		
		Запрос.Текст = ТекстЗапросаШтуки + ТекстЗапросаБлочки;
		ИмяКолонки = "ШтрихкодКоробки";
		
	ИначеЕсли  ТипАгрегации = 3 Тогда //паллета
		
		Запрос.Текст = ТекстЗапросаШтуки + ТекстЗапросаБлочки + ТекстЗапросаКоробки;
		ИмяКолонки = "ШтрихкодПалеты";
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("КодКМ", КодКМ);
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяКолонки%",ИмяКолонки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод"); 

КонецФункции // ()

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	КодАгрегации = ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"); 
	ДанныеОтсканированные.Очистить();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ДобавитьУсловноеОформление()

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.Ошибка"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОформления = ЭлементОформления.Оформление.Элементы[0];
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные");
	ПолеОформления.Использование = Истина;
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.Проверено"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОформления = ЭлементОформления.Оформление.Элементы[0];
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные");
	ПолеОформления.Использование = Истина;
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Паллета");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина;
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 2;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Короб");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина;
	
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 3;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Блочок");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина; 
	
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 4;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Штука");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина
	
	
КонецПроцедуры // ДобавитьУсловноеОформление()

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(); 
КонецПроцедуры
